<?php

return [

    'MSG_4000' => '不正なリクエストです。',
    'MSG_4010' => 'メールアドレスまたは、 パスワードが間違っています',
    'MSG_4011' => '認証トークンの有効期限が切れています。',
    'MSG_4012' => '認証トークンが無効です。',
    'MSG_4013' => 'この認証トークンは使用済みです。',
    'MSG_4030' => '権限がありません。',
    'MSG_4031' => 'アクセスは拒否されました。',
    'MSG_4032' => 'ブロックされています。',
    // 'MSG_4033' => 'アカウントは既に存在します。',
    'MSG_4040' => 'アカウントは存在しません。',
    'MSG_4041' => 'データが存在しません。',
    'MSG_4042' => 'メールアドレスの認証には事前にログインが必要です。',
    'MSG_4050' => 'HTTPメソッドが不正です。',
    'MSG_4090' => 'この操作はすでに実行されています。',
    'MSG_4091' => 'このアカウントは登録できません。',
    'MSG_4092' => 'すでに登録されているメールアドレスです',
    'MSG_4230' => '他のユーザが操作中です。',
    'MSG_5000' => 'システムエラーが発生しました。',
    'MSG_5001' => '予期せぬエラーが発生しました。',
    'MSG_5002' => 'DBエラーが発生しました。',
    'MSG_5003' => '登録に失敗しました。',
    'MSG_5004' => '更新に失敗しました。',
    'MSG_5005' => '削除に失敗しました。',

    'invalid_token' => 'トークンが不正です。',
    'incorrect_birthday' => '生年月日に謝りがあります',
];
